tap "homebrew/bundle"

brew "chezmoi"
brew "direnv"
brew "eza"
brew "gh"
brew "git"
brew "git-delta"
brew "lazygit"
brew "neovim"
brew "opentofu"
brew "pyenv"
brew "starship"
brew "terraform-docs"
brew "tree-sitter"
brew "trivy"
brew "uv"
brew "volta"

cask "1password-cli"

# os-specific
brew "mysql-client@8.0" if OS.mac?
cask "amazon-chime" if OS.mac?
cask "arc" if OS.mac?
cask "discord" if OS.mac?
cask "keymapp" if OS.mac?
cask "microsoft-teams" if OS.mac?
cask "orbstack" if OS.mac?
cask "raycast" if OS.mac?
cask "slack" if OS.mac?
cask "spotify" if OS.mac?
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Dark Reader for Safari", id: 1438243180
mas "Keynote", id: 409183694
mas "Keyword Search", id: 1558453954
mas "Parcel", id: 639968404
mas "PayPal Honey", id: 1472777122
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
